In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Project (project_id int, employee_id int)

In [ ]:
Create table If Not Exists Employee_years (employee_id int, name varchar(10), experience_years int)

In [ ]:
insert into Project (project_id, employee_id) values ('1', '1')

In [ ]:
insert into Project (project_id, employee_id) values ('1', '2')

In [ ]:
insert into Project (project_id, employee_id) values ('1', '3')

In [ ]:
insert into Project (project_id, employee_id) values ('2', '1')

In [ ]:
insert into Project (project_id, employee_id) values ('2', '4')

In [ ]:
insert into Employee_years (employee_id, name, experience_years) values ('1', 'Khaled', '3')

In [ ]:
insert into Employee_years (employee_id, name, experience_years) values ('2', 'Ali', '2')

In [ ]:
insert into Employee_years (employee_id, name, experience_years) values ('3', 'John', '1')

In [ ]:
insert into Employee_years (employee_id, name, experience_years) values ('4', 'Doe', '2')

In [ ]:
select * from employee_years

+-------------+--------+------------------+
| employee_id | name   | experience_years |
+-------------+--------+------------------+
| 1           | Khaled | 3                |
+-------------+--------+------------------+
| 2           | Ali    | 2                |
+-------------+--------+------------------+
| 3           | John   | 1                |
+-------------+--------+------------------+
| 4           | Doe    | 2                |
+-------------+--------+------------------+

In [ ]:
select * from project

+------------+-------------+
| project_id | employee_id |
+------------+-------------+
| 1          | 1           |
+------------+-------------+
| 1          | 2           |
+------------+-------------+
| 1          | 3           |
+------------+-------------+
| 2          | 1           |
+------------+-------------+
| 2          | 4           |
+------------+-------------+

## Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

In [ ]:
select * from employee_years left join project using (employee_id)

+-------------+--------+------------------+------------+
| employee_id | name   | experience_years | project_id |
+-------------+--------+------------------+------------+
| 1           | Khaled | 3                | 1          |
+-------------+--------+------------------+------------+
| 1           | Khaled | 3                | 2          |
+-------------+--------+------------------+------------+
| 2           | Ali    | 2                | 1          |
+-------------+--------+------------------+------------+
| 3           | John   | 1                | 1          |
+-------------+--------+------------------+------------+
| 4           | Doe    | 2                | 2          |
+-------------+--------+------------------+------------+

In [ ]:
select * from employee_years e, project p where e.employee_id = p.employee_id

+-------------+--------+------------------+------------+-------------+
| employee_id | name   | experience_years | project_id | employee_id |
+-------------+--------+------------------+------------+-------------+
| 1           | Khaled | 3                | 1          | 1           |
+-------------+--------+------------------+------------+-------------+
| 1           | Khaled | 3                | 2          | 1           |
+-------------+--------+------------------+------------+-------------+
| 2           | Ali    | 2                | 1          | 2           |
+-------------+--------+------------------+------------+-------------+
| 3           | John   | 1                | 1          | 3           |
+-------------+--------+------------------+------------+-------------+
| 4           | Doe    | 2                | 2          | 4           |
+-------------+--------+------------------+------------+-------------+

In [ ]:
select project_id, avg(experience_years) as average_years
from employee_years left join project 
using (employee_id)
group by project_id

+------------+---------------+
| project_id | average_years |
+------------+---------------+
| 1          | 2.0           |
+------------+---------------+
| 2          | 2.5           |
+------------+---------------+

In [ ]:
select project_id, avg(experience_years) as average_years
from employee_years e, project p where e.employee_id = p.employee_id
group by project_id

+------------+---------------+
| project_id | average_years |
+------------+---------------+
| 1          | 2.0           |
+------------+---------------+
| 2          | 2.5           |
+------------+---------------+